Revit 2027 API
TriangulationInterfaceForTriangulatedShellComponent Class
 This class is used to call FacetingUtils::convertTrianglesToQuads with a triangulation defined by a TriangulatedShellComponent.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TriangulationInterface
 Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TriangulationInterfaceForTriangulatedShellComponent : TriangulationInterface
Public Class TriangulationInterfaceForTriangulatedShellComponent
	Inherits TriangulationInterface
public ref class TriangulationInterfaceForTriangulatedShellComponent : public TriangulationInterface
type TriangulationInterfaceForTriangulatedShellComponent =
    class
        inherit TriangulationInterface
    end
The TriangulationInterfaceForTriangulatedShellComponent type exposes the following members.
Constructors
Name | Description
TriangulationInterfaceForTriangulatedShellComponent |  Constructs an interface object for a TriangulatedShellComponent.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from TriangulationInterface)
Top
Methods
Name | Description
Dispose
(Inherited from TriangulationInterface)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 Compare to TriangulationInterfaceForTriangulatedSolidOrShell, which treats with the entire solid or shell as a single triangulated structure.
See Also
Reference
Autodesk.Revit.DB Namespace